import Header from '../components/Header'

const PolicyCookie = () => {
  console.log(1234)

  return (
    <section>
      <Header />
      <div className="container mt-24 pl-10 pr-10">
        Пользователь самостоятельно определяет условия и предоставляет доступ к
        своим персональным данным неограниченному кругу лиц, в том числе путём
        регистрации и использования стандартной функциональности, а также с
        помощью настроек приватности и видимости своей персональной страницы в
        рамках предоставленной Пользователю функциональности в соответствии с п.
        6.3 настоящих Правил. Администрация Сайта не инициирует и не влияет на
        такой выбор Пользователя, а также не имеет цели получить у Пользователя
        разрешение на распространение его персональных данных. Обработка
        персональных данных, сделанных Пользователем доступными неограниченному
        кругу лиц, осуществляется Администрацией Сайта на основании и в
        соответствии с условиями Правил пользования сайтом ВКонтакте и настоящих
        Правил. 7. Меры по защите информации о Пользователях ▪ 7.1.
        Администрация Сайта принимает технические и организационно-правовые меры
        в целях обеспечения защиты персональных данных Пользователя от
        неправомерного или случайного доступа к ним, уничтожения, изменения,
        блокирования, копирования, распространения, а также от иных
        неправомерных действий. ▪ 7.2. Для авторизации доступа к Сайту
        используется логин (адрес электронной почты или номер мобильного
        телефона) и пароль Пользователя. Ответственность за сохранность данной
        информации несет Пользователь. Пользователь не вправе передавать
        собственный логин и пароль третьим лицам, а также обязан предпринимать
        меры по обеспечению их конфиденциальности. ▪ 7.3. В целях обеспечения
        более надежной защиты информации о Пользователях Администрация Сайта
        использует систему привязки страницы к мобильному телефону. Для
        осуществления данной системы Пользователь должен предоставить
        Администрации Сайта номер своего мобильного телефона. В рамках системы
        привязки страницы к мобильному телефону Пользователь в случае утраты
        логина или пароля может восстановить доступ к странице с помощью кода
        восстановления, содержащегося в SMS-сообщении, которое Пользователь
        получает на свой мобильный телефон. В целях снижения вероятности
        использования третьими лицами логинов и паролей Пользователей для
        отсылки спама от их имени, в случае если ввод логина и пароля
        Пользователя осуществляется с использованием непривычного для данного
        Пользователя сервера (в частности, сервера иностранного государства), *
        Администрация Сайта блокирует вход на персональную страницу Пользователя
        при помощи сообщения с требованием указать некоторые цифры мобильного
        телефона Пользователя. После трех неудачных попыток ввода цифр
        возможность доступа к персональной странице с использованием данного
        сервера блокируется на 4 часа. ▪ Администрация Сайта также вправе для
        целей регистрации, авторизации Пользователя, подтверждения актуальности
        привязанного к персональной странице (верификации) номера телефона,
        восстановления доступа к персональной странице осуществлять проверочный
        звонок-сброс на номер телефона Пользователя. После получения
        звонка-сброса Пользователю необходимо ввести код – несколько последних
        цифр номера, с которого осуществлен звонок-сброс, в соответствующем
        окне. В зависимости от операционной системы мобильного устройства ввод
        кода в соответствующем окне может осуществляться автоматически, но
        исключительно после получения от Пользователя разрешения на доступ к
        истории вызовов на мобильном устройстве. Данное разрешение
        предоставляется посредством нажатия кнопки «Разрешить» или аналогичной.
        Доступ к истории вызовов на мобильном устройстве Пользователя
        используется исключительно для цели автоматизации проставления кода при
        использовании функции проверочного звонка-сброса, а также защиты от
        спама и массовых регистраций. ▪ 7.4. Пользователь вправе получать
        информацию о том, в какое время и с каких устройств производилась
        авторизация на его персональную страницу, с помощью ссылки «Показать
        историю активности» в разделе «Мои Настройки / Безопасность». 8.
        Ограничение действия Правил Действие настоящих Правил не
        распространяется на действия и интернет-ресурсы третьих лиц.
        Администрация Сайта не несет ответственности за действия третьих лиц,
        получивших в результате использования Интернета или Услуг Сайта доступ к
        информации о Пользователе в соответствии с выбранным Пользователем
        уровнем конфиденциальности, за последствия использования информации,
        которая, в силу природы Сайта, доступна любому пользователю сети
        Интернет. Администрация Сайта рекомендует Пользователям ответственно
        подходить к решению вопроса об объеме информации о себе, размещаемой на
        Сайте. 9. Обращения пользователей ▪ 9.1. Пользователи вправе направлять
        Администрации Сайта свои запросы, в том числе запросы относительно
        использования их персональных данных, предусмотренные п. 6.1.6 настоящих
        Правил, в письменной форме по адресу: Россия, 191024, Санкт-Петербург,
        ул. Херсонская, д. 12-14, литер А, помещение 1-Н или в форме
        электронного документа, подписанного квалифицированной электронной
        подписью в соответствии с законодательством Российской Федерации, по
        адресу электронной почты: support@vk.com. ▪ 9.2. Запрос, направляемый
        пользователем, должен содержать следующую информацию: ▪ номер основного
        документа, удостоверяющего личность пользователя или его представителя;
        ▪ сведения о дате выдачи указанного документа и выдавшем его органе; ▪
        сведения, подтверждающие участие пользователя в отношениях с оператором
        (в частности, порядковый номер id пользователя или короткое
        (поддоменное) имя, заменяющее порядковый номер id); ▪ подпись
        пользователя или его представителя. ▪ 9.3. Администрация Сайта обязуется
        рассмотреть и направить ответ на поступивший запрос пользователя в
        течение 30 дней с момента поступления обращения. ▪ 9.4. Вся
        корреспонденция, полученная Администрацией Сайта от пользователей
        (обращения в письменной или электронной форме), относится к информации
        ограниченного доступа и не разглашается без письменного согласия
        Пользователя. Персональные данные и иная информация о Пользователе,
        направившем запрос, не могут быть без специального согласия Пользователя
        использованы иначе, как для ответа по теме полученного запроса или в
        случаях, прямо предусмотренных законодательством.
      </div>
    </section>
  )
}

export default PolicyCookie
